app/controllers/api/spots_controller.rb

  def index
    @spots = Spot.includes(:host, photos_attachments: :blob).all
---
SELECT "spots".* FROM "spots"

  def show
    @spot = Spot.includes(:host).with_attached_photos.find(params[:id])
---
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]